### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_record.mbp-a-192-168-2-100 will be created
+   resource "cloudflare_record" "mbp-a-192-168-2-100" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "mbp"
+       proxiable       = (known after apply)
+       proxied         = false
+       ttl             = 1
+       type            = "A"
+       value           = "192.168.2.100"
+       zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>